Revit 2027 API
BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterError Property
 This is used to post error. "Bar Engagement 2" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SecondaryEngagementParameterError { get; }
Public Shared ReadOnly Property SecondaryEngagementParameterError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SecondaryEngagementParameterError {
	FailureDefinitionId^ get ();
}
static member SecondaryEngagementParameterError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace